---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom1
source: html/5a835fdc-3bbe-a89d-7dd5-f9a2b22741b3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecDistributionNodeSupplyFrom1 Property

"Supply From 1"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecDistributionNodeSupplyFrom1 { get; }
```